'use strict';
module.exports = robot => {
  robot.hear(/n>/i, msg => {
     var hk = "ひか";
     var hkl = hk.length;
     var r = "";
     var hork = r+=hk[Math.floor(Math.random()*hkl)];

     

     var hira = ["あ","い","う","え","お","か","き","く","け","こ","さ","し","す","せ","そ","た","ち","つ","て","と","な","に","ぬ","ね","の","は","ひ","ふ","へ","ほ","ま","み","む","め","も","や","ゆ","よ","　","　","ら","り","る","れ","ろ","わ","を","ん","　","　","ぁ","ぃ","ぅ","ぇ","ぉ","ゃ","ゅ","ょ","っ","　","が","ぎ","ぐ","げ","ご","ぱ","ぴ","ぷ","ぺ","ぽ","ー","","。"];
     var hiral = hira.length;
     

     var hira2 = ["あ","い","う","え","お","か","き","く","け","こ","さ","し","す","せ","そ","た","ち","つ","て","と","な","に","ぬ","ね","の","は","ひ","ふ","へ","ほ","ま","み","む","め","も","や","ゆ","よ","　","　","ら","り","る","れ","ろ","わ","を","ん","　","　","ぁ","ぃ","ぅ","ぇ","ぉ","ゃ","ゅ","ょ","っ","　","が","ぎ","ぐ","げ","ご","ぱ","ぴ","ぷ","ぺ","ぽ","ー","　","。","","","","","","","","","","","","","","","","","","","",""];
     var hira2l = hira2.length;




     var kata = ["ア","イ","ウ","エ","オ","カ","キ","ク","ケ","コ","サ","シ","ス","セ","ソ","タ","チ","ツ","テ","ト","ナ","ニ","ヌ","ネ","ノ","ハ","ヒ","フ","ヘ","ホ","マ","ミ","ム","メ","モ","ヤ","ユ","ヨ","　","　","ラ","リ","ル","レ","ロ","ワ","ヲ","ン","　","　","ァ","ィ","ゥ","ェ","ォ","ャ","ュ","ョ","ッ","　","ガ","ギ","グ","ゲ","ゴ","パ","ピ","プ","ペ","ポ","ー","","。"];
     var katal = kata.length;


     var kata2 = ["ア","イ","ウ","エ","オ","カ","キ","ク","ケ","コ","サ","シ","ス","セ","ソ","タ","チ","ツ","テ","ト","ナ","ニ","ヌ","ネ","ノ","ハ","ヒ","フ","ヘ","ホ","マ","ミ","ム","メ","モ","ヤ","ユ","ヨ","　","　","ラ","リ","ル","レ","ロ","ワ","ヲ","ン","　","　","ァ","ィ","ゥ","ェ","ォ","ャ","ュ","ョ","ッ","　","ガ","ギ","グ","ゲ","ゴ","パ","ピ","プ","ペ","ポ","ー","","。","","","","","","","","","","","","","","","","","","","",""];
     var kata2l = kata2.length;



     if(hork=="ひ"){
      for(var i=0; i<2; i++){
        var hiragana =hira[Math.floor(Math.random()*hiral)];
        msg.send(hiragana);
  
       }
       for(var i=0; i<3; i++){
        var hiragana2 = hira2[Math.floor(Math.random()*hira2l)];
        if(hiragana2 == ""){
          break;
        } else {
          msg.send(hiragana2);
        }
       }
     }　else {
       for(var i=0; i<2; i++){
        var katakana = kata[Math.floor(Math.random()*katal)];
        msg.send(katakana);

       }
       for(var i=0; i<2; i++){
         var katakana2 = kata2[Math.floor(Math.random()*kata2l)];
          if (katakana2 == "") {
            break;
          }else {
            msg.send(katakana2);
          }
       }
     }

    
                  



     


     

     
     


  });
};
